modm-ext/data.modm.io/docs/svd/header_stm32h7a3xxq.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WWDG1</name>
      <description>Window WATCHDOG</description>
      <baseAddress>0x50003000</baseAddress>
      <interrupt>
        <name>WWDG</name>
        <description>Window WatchDog Interrupt ( wwdg1_it, wwdg2_it)</description>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>WWDG_RST</name>
        <description>Window Watchdog Event interrupt</description>
        <value>143</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>WWDG Control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>T</name>
              <description>T[6:0] bits (7-Bit counter (MSB to LSB))</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>WDGA</name>
              <description>Activation bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFR</name>
          <description>WWDG Configuration register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>W</name>
              <description>W[6:0] bits (7-bit window value)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>EWI</name>
              <description>Early Wakeup Interrupt</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDGTB</name>
              <description>WDGTB[2:0] bits (Timer Base)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRESCALER_1</name>
                  <description>WWDG counter clock = (PCLK1/4096)/1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_2</name>
                  <description>WWDG counter clock = (PCLK1/4096)/2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_4</name>
                  <description>WWDG counter clock = (PCLK1/4096)/4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_8</name>
                  <description>WWDG counter clock = (PCLK1/4096)/8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_16</name>
                  <description>WWDG counter clock = (PCLK1/4096)/16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_32</name>
                  <description>WWDG counter clock = (PCLK1/4096)/32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_64</name>
                  <description>WWDG counter clock = (PCLK1/4096)/64</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_128</name>
                  <description>WWDG counter clock = (PCLK1/4096)/128</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>WWDG Status register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EWIF</name>
              <description>Early Wakeup Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>GPV</name>
      <description>Global Programmer View</description>
      <baseAddress>0x51000000</baseAddress>
      <registers>
        <register>
          <name>AXI_PERIPH_ID_4</name>
          <description>AXI interconnect - peripheral ID4 register</description>
          <addressOffset>0x1fd0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_PERIPH_ID_5</name>
          <description>Reserved</description>
          <addressOffset>0x1fd4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_PERIPH_ID_6</name>
          <description>Reserved</description>
          <addressOffset>0x1fd8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_PERIPH_ID_7</name>
          <description>Reserved</description>
          <addressOffset>0x1fdc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_PERIPH_ID_0</name>
          <description>AXI interconnect - peripheral ID0 register</description>
          <addressOffset>0x1fe0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_PERIPH_ID_1</name>
          <description>AXI interconnect - peripheral ID1 register</description>
          <addressOffset>0x1fe4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_PERIPH_ID_2</name>
          <description>AXI interconnect - peripheral ID2 register</description>
          <addressOffset>0x1fe8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_PERIPH_ID_3</name>
          <description>AXI interconnect - peripheral ID3 register</description>
          <addressOffset>0x1fec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_COMP_ID_0</name>
          <description>AXI interconnect - component ID0 register</description>
          <addressOffset>0x1ff0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_COMP_ID_1</name>
          <description>AXI interconnect - component ID1 register</description>
          <addressOffset>0x1ff4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_COMP_ID_2</name>
          <description>AXI interconnect - component ID2 register</description>
          <addressOffset>0x1ff8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_COMP_ID_3</name>
          <description>AXI interconnect - component ID3 register</description>
          <addressOffset>0x1ffc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG1_FN_MOD_ISS_BM</name>
          <description>AXI interconnect - TARG 1 bus matrix issuing functionality register</description>
          <addressOffset>0x2008</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG1_FN_MOD2</name>
          <description>AXI interconnect - TARG 1 bus matrix functionality 2 register</description>
          <addressOffset>0x2024</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG1_FN_MOD_LB</name>
          <description>AXI interconnect - TARG 1 long burst functionality modification register</description>
          <addressOffset>0x202c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG1_FN_MOD</name>
          <description>AXI interconnect - TARG 1 issuing functionality modification register</description>
          <addressOffset>0x2108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG2_FN_MOD_ISS_BM</name>
          <description>AXI interconnect - TARG 2 bus matrix issuing functionality register</description>
          <addressOffset>0x3008</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG2_FN_MOD2</name>
          <description>AXI interconnect - TARG 2 bus matrix functionality 2 register</description>
          <addressOffset>0x3024</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG2_FN_MOD_LB</name>
          <description>AXI interconnect - TARG 2 long burst functionality modification register</description>
          <addressOffset>0x302c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG2_FN_MOD</name>
          <description>AXI interconnect - TARG 2 issuing functionality modification register</description>
          <addressOffset>0x3108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG3_FN_MOD_ISS_BM</name>
          <description>AXI interconnect - TARG 3 bus matrix issuing functionality register</description>
          <addressOffset>0x4008</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG4_FN_MOD_ISS_BM</name>
          <description>AXI interconnect - TARG 4 bus matrix issuing functionality register</description>
          <addressOffset>0x5008</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG5_FN_MOD_ISS_BM</name>
          <description>AXI interconnect - TARG 5 bus matrix issuing functionality register</description>
          <addressOffset>0x6008</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG6_FN_MOD_ISS_BM</name>
          <description>AXI interconnect - TARG 6 bus matrix issuing functionality register</description>
          <addressOffset>0x7008</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG7_FN_MOD_ISS_BM</name>
          <description>AXI interconnect - TARG 7 bus matrix issuing functionality register</description>
          <addressOffset>0x8008</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG7_FN_MOD2</name>
          <description>AXI interconnect - TARG 7 bus matrix functionality 2 register</description>
          <addressOffset>0x8024</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG7_FN_MOD_LB</name>
          <description>AXI interconnect - TARG 7 long burst functionality modification register</description>
          <addressOffset>0x802c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG7_FN_MOD</name>
          <description>AXI interconnect - TARG 7 issuing functionality modification register</description>
          <addressOffset>0x8108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG8_FN_MOD_ISS_BM</name>
          <description>AXI interconnect - TARG 8 bus matrix issuing functionality register</description>
          <addressOffset>0x9008</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG8_FN_MOD2</name>
          <description>AXI interconnect - TARG 8 bus matrix functionality 2 register</description>
          <addressOffset>0x9024</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG8_FN_MOD</name>
          <description>AXI interconnect - TARG 8 issuing functionality modification register</description>
          <addressOffset>0x9108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG9_FN_MOD_ISS_BM</name>
          <description>AXI interconnect - TARG 9 bus matrix issuing functionality register</description>
          <addressOffset>0xa008</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG9_FN_MOD2</name>
          <description>AXI interconnect - TARG 9 bus matrix functionality 2 register</description>
          <addressOffset>0xa024</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG9_FN_MOD</name>
          <description>AXI interconnect - TARG 9 issuing functionality modification register</description>
          <addressOffset>0xa108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG10_FN_MOD_ISS_BM</name>
          <description>AXI interconnect - TARG 10 bus matrix issuing functionality register</description>
          <addressOffset>0xb008</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG10_FN_MOD2</name>
          <description>AXI interconnect - TARG 10 bus matrix functionality 2 register</description>
          <addressOffset>0xb024</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG10_FN_MOD</name>
          <description>AXI interconnect - TARG 10 issuing functionality modification register</description>
          <addressOffset>0xb108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG10_FN_MOD_LB</name>
          <description>AXI interconnect - TARG 10 long burst functionality modification register</description>
          <addressOffset>0xc02c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI1_FN_MOD2</name>
          <description>AXI interconnect - INI 1 functionality modification 2 register</description>
          <addressOffset>0x42024</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI1_FN_MOD_AHB</name>
          <description>AXI interconnect - INI 1 AHB functionality modification register</description>
          <addressOffset>0x42028</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI1_READ_QOS</name>
          <description>AXI interconnect - INI 1 read QoS register</description>
          <addressOffset>0x42100</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI1_WRITE_QOS</name>
          <description>AXI interconnect - INI 1 write QoS register</description>
          <addressOffset>0x42104</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI1_FN_MOD</name>
          <description>AXI interconnect - INI 1 issuing functionality modification register</description>
          <addressOffset>0x42108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI2_READ_QOS</name>
          <description>AXI interconnect - INI 2 read QoS register</description>
          <addressOffset>0x43100</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI2_WRITE_QOS</name>
          <description>AXI interconnect - INI 2 write QoS register</description>
          <addressOffset>0x43104</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI2_FN_MOD</name>
          <description>AXI interconnect - INI 2 issuing functionality modification register</description>
          <addressOffset>0x43108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI3_FN_MOD2</name>
          <description>AXI interconnect - INI 3 functionality modification 2 register</description>
          <addressOffset>0x44024</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI3_FN_MOD_AHB</name>
          <description>AXI interconnect - INI 3 AHB functionality modification register</description>
          <addressOffset>0x44028</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI3_READ_QOS</name>
          <description>AXI interconnect - INI 3 read QoS register</description>
          <addressOffset>0x44100</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI3_WRITE_QOS</name>
          <description>AXI interconnect - INI 3 write QoS register</description>
          <addressOffset>0x44104</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI3_FN_MOD</name>
          <description>AXI interconnect - INI 3 issuing functionality modification register</description>
          <addressOffset>0x44108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI4_READ_QOS</name>
          <description>AXI interconnect - INI 4 read QoS register</description>
          <addressOffset>0x45100</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI4_WRITE_QOS</name>
          <description>AXI interconnect - INI 4 write QoS register</description>
          <addressOffset>0x45104</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI4_FN_MOD</name>
          <description>AXI interconnect - INI 4 issuing functionality modification register</description>
          <addressOffset>0x45108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI5_READ_QOS</name>
          <description>AXI interconnect - INI 5 read QoS register</description>
          <addressOffset>0x46100</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI5_WRITE_QOS</name>
          <description>AXI interconnect - INI 5 write QoS register</description>
          <addressOffset>0x46104</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI5_FN_MOD</name>
          <description>AXI interconnect - INI 5 issuing functionality modification register</description>
          <addressOffset>0x46108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI6_READ_QOS</name>
          <description>AXI interconnect - INI 6 read QoS register</description>
          <addressOffset>0x47100</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI6_WRITE_QOS</name>
          <description>AXI interconnect - INI 6 write QoS register</description>
          <addressOffset>0x47104</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI6_FN_MOD</name>
          <description>AXI interconnect - INI 6 issuing functionality modification register</description>
          <addressOffset>0x47108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI7_FN_MOD2</name>
          <description>AXI interconnect - INI 7 functionality modification 2 register</description>
          <addressOffset>0x48024</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI7_FN_MOD_AHB</name>
          <description>AXI interconnect - INI 7 AHB functionality modification register</description>
          <addressOffset>0x48028</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI7_READ_QOS</name>
          <description>AXI interconnect - INI 7 read QoS register</description>
          <addressOffset>0x48100</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI7_WRITE_QOS</name>
          <description>AXI interconnect - INI 7 write QoS register</description>
          <addressOffset>0x48104</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI7_FN_MOD</name>
          <description>AXI interconnect - INI 7 issuing functionality modification register</description>
          <addressOffset>0x48108</addressOffset>
          <size>0x20</size>
        </register>
